app/controllers/scores_controller.rb

  def index
    @scores = Score.order(highScores: :desc).limit(1);
---
SELECT "scores".* FROM "scores" ORDER BY "scores"."highScores" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @score = Score.new(score_params)

    if @score.save
---
INSERT INTO "scores" ("created_at", "updated_at", "highScores") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-12-18 05:13:19.081136"], ["updated_at", "2019-12-18 05:13:19.081136"], ["highScores", 5]]